## Task

## Table1 Infomation Having the information 
### Main Table
- Wk,	
- Employee,	
- Project	%Time

In [81]:
### Import the libraries
import pandas as pd 
import numpy as np

In [82]:
## Create a DF for the Table 1
# Sample DataFrames
main_table = pd.DataFrame({
    'Wk': [1, 1, 1, 2, 2],
    'Employee': ['Alice', 'Bob', 'Alice', 'Charlie', 'Bob'],
    'Project': ['ProjA', 'ProjB', 'ProjC', 'ProjD', 'ProjE'],
    '%Time': [50, 60, 50, 80, 40]
})

In [83]:
main_table

   Wk Employee Project  %Time
0   1    Alice   ProjA     50
1   1      Bob   ProjB     60
2   1    Alice   ProjC     50
3   2  Charlie   ProjD     80
4   2      Bob   ProjE     40

## Table 2 Infomation 
### Employee List
- Name	
- Position	
- Skills	
- CurrentStatus

In [84]:
employee_list = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Position': ['Manager', 'Developer', 'Analyst'],
    'Skills': ['Python, ML', 'Java, SQL', 'R, Analytics'],
    'CurrentStatus': ['Active', 'Active', 'Active']
})

In [85]:
employee_list

      Name   Position        Skills CurrentStatus
0    Alice    Manager    Python, ML        Active
1      Bob  Developer     Java, SQL        Active
2  Charlie    Analyst  R, Analytics        Active

### Table 3 Infomation

### Project List
- Project	
- Description	
- StartDate	
- ExpWeeks	
- Internal/External	
- Status

In [86]:

project_list = pd.DataFrame({
    'Project': ['ProjA', 'ProjB', 'ProjC', 'ProjD', 'ProjE'],
    'Description': ['Analysis', 'Development', 'Testing', 'Reporting', 'Design'],
    'StartDate': ['2024-01-01', '2024-02-01', '2024-03-01', '2024-04-01', '2024-05-01'],
    'ExpWeeks': [4, 6, 8, 3, 5],
    'Internal/External': ['Internal', 'External', 'Internal', 'External', 'Internal'],
    'Status': ['Active', 'Completed', 'On Hold', 'Active', 'Active']
})

In [87]:
project_list

  Project  Description   StartDate  ExpWeeks Internal/External     Status
0   ProjA     Analysis  2024-01-01         4          Internal     Active
1   ProjB  Development  2024-02-01         6          External  Completed
2   ProjC      Testing  2024-03-01         8          Internal    On Hold
3   ProjD    Reporting  2024-04-01         3          External     Active
4   ProjE       Design  2024-05-01         5          Internal     Active

In [88]:
# Step 1: Merge main_table with employee_list to add employee details
merged_data = pd.merge(main_table, employee_list, left_on='Employee', right_on='Name', how='left')

In [89]:
merged_data

   Wk Employee Project  %Time     Name   Position        Skills CurrentStatus
0   1    Alice   ProjA     50    Alice    Manager    Python, ML        Active
1   1      Bob   ProjB     60      Bob  Developer     Java, SQL        Active
2   1    Alice   ProjC     50    Alice    Manager    Python, ML        Active
3   2  Charlie   ProjD     80  Charlie    Analyst  R, Analytics        Active
4   2      Bob   ProjE     40      Bob  Developer     Java, SQL        Active

In [99]:

# Generate Output Table
output = main_table.pivot_table(        
    index='Employee',
    columns='Project',
    values= '%Time',
    #aggfunc='first'
).fillna(0)

In [100]:
output

Project   ProjA  ProjB  ProjC  ProjD  ProjE
Employee
Alice      50.0    0.0   50.0    0.0    0.0
Bob         0.0   60.0    0.0    0.0   40.0
Charlie     0.0    0.0    0.0   80.0    0.0

In [92]:
output.columns

Index(['ProjA', 'ProjB', 'ProjC', 'ProjD', 'ProjE'], dtype='object', name='Project')

In [93]:
# Flatten MultiIndex and rename columns
#The code flattens a MultiIndex created by pivot_table() into single-level columns.
#output.columns = [f'{col[0]}{col[1]}' for col in output.columns] 
#output.reset_index(inplace=True)

In [98]:
output

Project   ProjA  ProjB  ProjC  ProjD  ProjE
Employee
Alice      50.0    NaN   50.0    NaN    NaN
Bob         NaN   60.0    NaN    NaN   40.0
Charlie     NaN    NaN    NaN   80.0    NaN

### Output Table

 
- Name
- Project1
- %Time1	
- Project2	
- %Time2	
- Project3	
- %Time3